[{
  "name": "EventType",
  "description": "Enum of api-accessible events. The event types in this enum have a protobuf implementation, and can be used, for example, in the api event stream and publishers.",
  "values": {
    "DEFAULT": ""
    ,"ORGANIZATION_CREATED": "A new organization was created under your organization."
    ,"ORGANIZATION_UPDATED": "Your organization information was updated. This deals with things like display name and contact information, not users and devices."
    ,"ORGANIZATION_DELETED": "An organization under your organization was deleted."
    ,"ORGANIZATION_EVENT_CONFIGURATION_UPDATED": "Your organization's event configuration was updated. This refers to things like message summary configuration."
    ,"DEVICE_CREATED": "A new device was created in your organization, either manually or by a gateway."
    ,"DEVICE_UPDATED": "A device in your organization was manually updated (i.e. renamed, tagged)."
    ,"DEVICE_LOCATION_UPDATED": "The location of a device in your organization was updated, either manually or by a message."
    ,"DEVICE_INSTALLED": "A device in your organization was installed and should now be active."
    ,"MESSAGE_RECEIVED": "A device in your organization sent a message. This event is the final output for the message, after any parsing and post-processing."
    ,"MESSAGE_BODY_PARSED": "A device in your organization sent a message, and it was parsed by a message body parser. For the final event, with all applied parsers and post processing, use MESSAGE_RECEIVED instead."
    ,"MESSAGE_BODY_RECEIVED": "A device in your organization sent a message, and it has been scheduled for parsing by message body parsers and post-processing. For the final event, with all applied parsers and post processing, use MESSAGE_RECEIVED instead."
    ,"MESSAGE_CANNOT_BE_PARSED": "A device in your organization sent a message, and it could not be parsed by any assigned message body parser. This is typically a configuration issue. Please contact customer support if this is not resolved."
    ,"MESSAGE_SUMMARY": "A summary of messages in your organization was created, based on your event configuration."
    ,"MESSAGE_BODY_PARSER_CREATED": "A new message body parser was created in your organization. This typically only happens for custom solutions."
    ,"MESSAGE_BODY_PARSER_UPDATED": "A message body parser in your organization was updated. This typically only happens for custom solutions."
    ,"MESSAGE_BODY_PARSER_DELETED": "A message body parser in your organization was deleted. This typically only happens for custom solutions."
    ,"ALARM_TRIGGERED": "An alarm was triggered in your organizations. Depending on the alarm, this may mean that a device sent a message with a value (e.g. pressure) outside of the expected range, or moved out of the expected area."
    ,"ALARM_CREATED": "A new alarm was created in your organization."
    ,"ALARM_UPDATED": "An alarm in your organization was updated."
    ,"ALARM_DELETED": "An alarm in your organization was deleted."
    ,"ASSIGNED": "An assignment was made in your organization. For example: assigning a tag or alarm to a modem."
    ,"UNASSIGNED": "An assignment was removed in your organization. For example: removing a tag or alarm from a modem."
    ,"TRANSFER": "A device was transferred into or out of your organization. Transferred device lose their data and are only used in the new organization if connected to a gateway in that organization."
    ,"PUBLISHER_CREATED": "A new publisher was created in your organization. Publishers are any system that pushes data out of the system, like webhooks, MQTT integrations and even email preferences."
    ,"PUBLISHER_UPDATED": "A publisher in your organization was updated. Publishers are any system that pushes data out of the system, like webhooks, MQTT integrations and even email preferences."
    ,"PUBLISHER_DELETED": "A publisher in your organization was deleted. Publishers are any system that pushes data out of the system, like webhooks, MQTT integrations and even email preferences."
    ,"PUBLISHER_FAILED": "A publisher in your organization failed to send its data. This can be a temporary issue (perhaps the webhook endpoint is down) or an indication of a configuration issue. Publishers are any system that pushes data out of the system, like webhooks, MQTT integrations and even email preferences."
    ,"PUBLISHER_AUTO_DISABLED": "A publisher in your organization failed to send its data for a long enough period that is has been disabled. This means the failures were not a temporary issue, but there is something wrong with the configuration. Publishers are any system that pushes data out of the system, like webhooks, MQTT integrations and even email preferences."
    ,"USER_ACCESS_REQUEST": "A user has requested access to your organization. You can review their request and approve or reject them."
    ,"USER_INVITED": "A user was invited into your organization. They can review your invite and accept it or ignore it."
    ,"USER_ADDED": "A user was granted access to your organization, by request, invite, or created by an organization admin."
    ,"USER_REMOVED": "A user was removed from your organization by an organization admin."
    ,"USER_VALIDATION_UPDATED": "The user validation (i.e. email domain) for your organization was updated."
    ,"TOKEN_CREATED": "A new token was created for your organization."
    ,"TOKEN_EXPIRY_WARNING": "A token in your organization will expire within 2 weeks."
    ,"TOKEN_EXPIRED": "A token in your organization has expired."
    ,"TOKEN_DELETED": "A token in your organization was deleted."
    ,"EXPORT_CREATED": "A new export was started for your organization, exporting data (i.e. messages) to a file."
    ,"EXPORT_READY": "An export in your organization has completed and the resulting file with data (i.e. messages as CSV) is ready to be downloaded."
    ,"EXPORT_FAILED": "An export in your organization has failed (typically because of incorrect data selection)."
    }
},{
  "name": "Health",
  "description": "Health is an indicator for issues. It is used for publishers to give a quick indication of issues.",
  "values": {
    "OK": ""
    ,"WARNING": ""
    ,"ERROR": ""
    }
},{
  "name": "UnitOfMeasurement",
  "description": "Unit of measurement for a numeric value.",
  "values": {
    "UNIT_UNKNOWN": ""
    ,"DURATION_MILLISECONDS": ""
    ,"DURATION_SECONDS": ""
    ,"DURATION_MINUTES": ""
    ,"DURATION_HOURS": ""
    ,"DURATION_DAYS": ""
    ,"DURATION_WEEKS": ""
    ,"FUEL_EFFICIENCY_LITER_PER_100_KILOMETER": ""
    ,"FUEL_EFFICIENCY_KILOMETER_PER_LITER": ""
    ,"FUEL_EFFICIENCY_KILOMETER_PER_US_GALLON": ""
    ,"FUEL_EFFICIENCY_KILOMETER_PER_IMPERIAL_GALLON": ""
    ,"FUEL_EFFICIENCY_MILE_PER_US_GALLON": ""
    ,"FUEL_EFFICIENCY_MILE_PER_IMPERIAL_GALLON": ""
    ,"FUEL_EFFICIENCY_MILE_PER_LITER": ""
    ,"DISTANCE_METER": ""
    ,"DISTANCE_MILLIMETER": ""
    ,"DISTANCE_CENTIMETER": ""
    ,"DISTANCE_KILOMETER": ""
    ,"DISTANCE_NAUTICAL_MILE": ""
    ,"DISTANCE_MILE": ""
    ,"DISTANCE_YARD": ""
    ,"DISTANCE_FOOT": ""
    ,"DISTANCE_INCH": ""
    ,"PERCENT": ""
    ,"PRESSURE_BAR": ""
    ,"PRESSURE_PSI": ""
    ,"PRESSURE_K_PA": ""
    ,"SPEED_KILOMETERS_PER_HOUR": ""
    ,"SPEED_KNOTS": ""
    ,"SPEED_METERS_PER_SECOND": ""
    ,"SPEED_MILES_PER_HOUR": ""
    ,"TEMPERATURE_KELVIN": ""
    ,"TEMPERATURE_DEGREES_CELSIUS": ""
    ,"TEMPERATURE_DEGREES_FAHRENHEIT": ""
    ,"VOLTAGE_MILLIVOLT": ""
    ,"VOLUME_LITER": ""
    ,"VOLUME_GALLON_US": ""
    ,"VOLUME_GALLON_IMPERIAL": ""
    ,"VOLUME_CUBIC_METER": ""
    ,"VOLUME_CUBIC_FOOT": ""
    ,"MASS_KILOGRAMS": ""
    ,"MASS_POUNDS": ""
    ,"FLOW_CUBIC_METERS_PER_HOUR": ""
    ,"FLOW_BARRELS_PER_DAY": ""
    ,"REVOLUTIONS_PER_MINUTE": ""
    ,"ITEMS_PER_24_HOURS": ""
    }
}]